import PromoDataCardProps from 'types/Promo/PromoDataCardProps';

const promoDataCards: PromoDataCardProps[] = [
  {
    id: 0,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 1,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 2,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 3,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 4,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 5,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 6,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 7,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
  {
    id: 8,
    img: 'img/promoImg.jpg',
    title: 'Специальное предложение на линзы для очков Stellest',
    description: 'Купи линзы Stellest с тонировкой со СКИДКОЙ 50%!',
    fullDescription:
      'Скидка 50% на линзы для детей Stellest с тонировкой! Никаких условий, только выгода! Позаботьтесь о здоровье своих детей. Акция действительна во всех салонах оптики Vidial. Скидка не суммируется с другими скидками и спец.предложениями. Подробности по тел. 511-333 или у продавцов-консультантов.',
    startDate: new Date('2024-01-01'),
    endDate: new Date('2024-02-01'),
  },
];

export { promoDataCards };
